<?php

namespace rezident\KladrJson\row;


use rezident\KladrJson\exceptions\UnknownAbbrException;

class Abbreviation
{
    /**
     * @var string
     */
    private $prefix;

    /**
     * @var string
     */
    private $suffix;

    /**
     * @var string
     */
    private $abbr;

    static public $map = [
        'Респ'      => ['Республика',   ''],
        'х'         => ['х.',   ''],
        'п'         => ['п.',   ''],
        'ст-ца'     => ['станица',   ''],
        'снт'       => ['',   ''],
        'дп'        => ['',   ''],
        'аул'       => ['аул',   ''],
        'с'         => ['с.',   ''],
        'с/п'       => ['сп',   ''],
        'пгт'       => ['пгт',   ''],
        'г'         => ['',   ''],
        'тер'       => ['',   ''],
        'нп'        => ['',   ''],
        'рзд'       => ['',   ''],
        'д'         => ['д.',   ''],
        'казарма'   => ['',   ''],
        'кордон'    => ['',   ''],
        'рп'        => ['рп',   ''],
        'ст'        => ['ст.',   ''],
        'аал'       => ['аал',   ''],
        'м'         => ['м.',   ''],
        'мкр'       => ['',   ''],
        'с/с'       => ['сс',   ''],
        'промзона'  => ['',   ''],
        'ж/д_будка' => ['',   ''],
        'п/ст'      => ['',   ''],
        'у'         => ['улус',   ''],
        'заимка'    => ['з.',   ''],
        'остров'    => ['о.',   ''],
        'ж/д_оп'    => ['',   ''],
        'кв-л'      => ['',   ''],
        'ж/д_рзд'   => ['',   ''],
        'ж/д_ст'    => ['',   ''],
        'городок'   => ['',   ''],
        'кп'        => ['кп',   ''],
        'гп'        => ['гп',   ''],
        'автодорога'=> ['',   ''],
        'п/о'       => ['',   ''],
        'высел'     => ['высел',   ''],
        'починок'   => ['починок',   ''],
        'арбан'     => ['арбан',   ''],
        'жилрайон'  => ['жилрайон',   ''],
        'с/мо'      => ['',   ''],
        'ж/д_казарм'=> ['',   ''],
        'массив'    => ['',   ''],
        'Чувашия'   => ['',   ''],
        'ж/д_пост'  => ['',   ''],
        'погост'    => ['',   ''],
        'жилзона'   => ['',   ''],
        'сл'        => ['сл.',   ''],
        'с/а'       => ['са',   ''],
        'АО'        => ['',   'автономный округ'],
        'Аобл'      => ['',   'автономная область'],
        'ж/д_платф' => ['',   ''],
        'округ'     => ['',   ''],
        'ул'        => ['',   ''],
        'с/о'       => ['со',   ''],
        'п/р'       => ['',   ''],
        'ш'         => ['',   ''],
        'км'        => ['',   ''],
        'днп'       => ['',   ''],
        'лпх'       => ['',   ''],
        'обл'       => ['',   'область'],
        'край'      => ['',   'край'],
        'р-н'       => ['',     'район']
    ];

    public function __construct($abbr)
    {
        if(isset(self::$map[$abbr]) == false) {
            throw new UnknownAbbrException($abbr);
        }

        $this->prefix = self::$map[$abbr][0];
        $this->suffix = self::$map[$abbr][1];
        $this->abbr = $abbr;
    }

    public function getWrappedName($name)
    {
        $name = ' ' . trim($name) . ' ';
        return trim($this->prefix . $name . $this->suffix);
    }

    /**
     * @return string
     */
    public function getAbbr()
    {
        return $this->abbr;
    }


}